# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  

Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. 
Make sure you import pandas.

In [3]:
#Write your code here

import pandas as pd

df_data = pd.read_csv("C:\\Users\\VISHAL\\Documents\\Python\\Pandas\\Assignment_Pandas Basic\\Purchase_Data.csv")

df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [2]:
#Write your code here

df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [4]:
df_data.columns

Index(['invoice_number', 'invoice_time', 'store_id', 'product_id',
       'category_id', 'num_item', 'price'],
      dtype='object')

In [21]:
#Write you code here

#result_1 = df_data.loc[ : , 'invoice_number':'invoice_time'] 

#result_1.head()


result = df_data.iloc[ : ,  [0, 1] ]

result .head()

# loc 
# iloc (indexing)

# .loc(row , column)

# all rows
# columns: first 2

# df.columns , df.index

   invoice_number   invoice_time
0    2.020000e+11  7/15/15 10:45
1    2.020000e+11  7/15/15 12:16
2    2.020000e+11  7/15/15 12:16
3    2.020000e+11  7/15/15 12:16
4    2.020000e+11  7/15/15 12:16

Slice the first two rows using .loc and store the result in a variable called result_2.

In [22]:
#Write you code here

#Syntax for loc: .loc[row, column]

result_2=df_data.loc[0:1, :]

result_2.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [24]:
#Write your code here

#either use .loc or .iloc and give the code ?

result_3 = df_data.iloc[0:4,0:5]
result_3.head()

result_3=df_data.iloc[0:4,0:5]
result_3.head()

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

In [26]:
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [29]:
#Write your code here

#.loc
#result_5=df_data.loc[[0,4,6],['invoice_time','price']]
#result_5

# .iloc

result_4 = df_data.iloc[[0,4,6], [0,6]]
result_4

   invoice_number  price
0    2.020000e+11    2.0
4    2.020000e+11    6.0
6    2.020000e+11    2.0

Store the number rows in a variable called num_rows.

In [32]:
shape_df = df_data.shape
print (shape_df)

num_rows = shape_df [0]

print (num_rows)

(5382, 7)
5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [33]:
df_data.tail()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5377,2.020000e+11,9/5/15 23:07,300,7308017,210101,1.0,3.0
5378,2.020000e+11,9/5/15 23:23,G619,7070891,70401,1.0,6.0
5379,2.020000e+11,9/5/15 23:24,G619,7071096,70201,1.0,5.0
5380,2.020000e+11,9/5/15 23:32,G619,15000231,70301,2.0,2.0
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

In [37]:
#Write your code here

#use .loc or .iloc

result_6 = df_data.loc [ num_rows-1 , :]

result_6["price"]

2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [4]:
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

In [6]:
#Write your code here

avg_price = df_data["price"].mean()
max_price = df_data["price"].max()

avg_price, max_price

(3.1920522110741354, 6.01)

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [9]:
#Write you code here

averages = df_data[["price","num_item"]].mean()

print (averages)
type(averages)


avg_price = averages["price"]
avg_num_items = averages["num_item"]

avg_price , avg_num_items

price       3.192052
num_item    1.298309
dtype: float64

(3.1920522110741354, 1.2983091787439613)

Create a column called "total", which is the product of the price and num_item columns.

In [10]:
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

In [11]:
#Write your code here

df_data['total'] = df_data['num_item'] * df_data['price']

df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the average price of the three most expensive purchases?

In [16]:
#Write your code here

#Sort the dataframe in descending order?

df_data_sorted= df_data.sort_values(by= "total" , inplace= False , ascending= False)

df_data_sorted.head()

#use the row index and get the location by using .loc(row-index: 4510, 3784, 4288) ,column name: total)

top_three = df_data_sorted.loc[[4510,3784,4288], "total"]

top_three

#compute average of these top 3 values
top_three.mean()

164.0

How many different products are there?

In [18]:
#Write your code here

unique_products = df_data["product_id"].unique()

n_products = len(unique_products)

print (n_products)

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [21]:
#Write your code here

df_summary = df_data.describe()

mean_total = df_summary.loc["mean", "total"]

median_total = df_summary.loc["50%" , "total"]

difference = mean_total - median_total

difference

0.9318078781127945

Use the drop() method to delete the column total from the dataframe df_data.

In [24]:
#Write your code here

df_data_2 = df_data.drop('total', inplace=False, axis=1)
df_data_2.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

In [25]:
#Write your code here

df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
total             float64
dtype: object

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [27]:
pwd

'C:\\Users\\VISHAL\\Documents\\Python\\Pandas\\Assignment_Pandas Basic'

In [28]:
#Write your code here

#hint: re-read the file (argument in read_csv: parse_dates)


df_data = pd.read_csv ("Purchase_Data.csv", parse_dates = ["invoice_time"])
df_data.dtypes

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [31]:
#Write your code here

df_data ["month"] = df_data["invoice_time"].dt.month

df_data ["DOW"] = df_data["invoice_time"].dt.weekday_name

df_data["DOW"].value_counts()

Wednesday    959
Friday       906
Thursday     828
Saturday     800
Tuesday      666
Monday       616
Sunday       607
Name: DOW, dtype: int64

In [34]:
df_data['DOW']= df_data["invoice_time"].dt.day_name()
df_data['month']=df_data["invoice_time"].dt.month
df_data["DOW"].value_counts()

Wednesday    959
Friday       906
Thursday     828
Saturday     800
Tuesday      666
Monday       616
Sunday       607
Name: DOW, dtype: int64

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [35]:
#Write your code here

counts_DOW = df_data["DOW"].value_counts()

num_purchases_wed = counts_DOW["Wednesday"]

num_purchases_wed

959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [44]:
#Write your code here

import pandas as pd

df_titanic = pd.read_csv("Titanic.csv")

df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [46]:
#Write your code here

#df_titanic.rename({'Name':'Passenger_Name', 'Ticket':'Ticket_num'}, inplace=True)

df_titanic.rename(columns={'Name':'Passenger_Name','Ticket':'Ticket_num'},inplace=True)

df_titanic.head()

,PassengerId,Pclass,Passenger Name,Sex,Age,SibSp,Parch,Ticket_num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [48]:
#Write your code here

df_titanic.set_index('PassengerId', inplace=True)
df_titanic.head()

,Pclass,Passenger Name,Sex,Age,SibSp,Parch,Ticket_num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [50]:
#Write your code here

df_titanic.loc[896, "Passenger Name"]

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [51]:
#Write your code here

df_titanic.reset_index(drop=False, inplace=True)

df_titanic.head()

,PassengerId,Pclass,Passenger Name,Sex,Age,SibSp,Parch,Ticket_num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? 
Hint: Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [56]:
#Write you code here

df_titanic["Age"].isnull().sum()

86

Compute the avg age of passengers ignoring the missing data.

In [57]:
#Write your code here

mean_age = df_titanic["Age"].mean()
mean_age

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [11]:
#Write your code here

df_titanic['Age'].fillna(mean_age)

#Understand fillna as a dictionary with key as column name and value as the value you need to feed that column, ex: mean

#column name: Age (Key)
#Mean of age (Value)

df_titanic.fillna( {"Age": mean_age}, inplace=True)

df_titanic.head()

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [60]:
#Write your code here

# Use sort_values to sort by age descending

df_titanic.sort_values(by='Age', ascending=False)

df_titanic.sort_values("Age", ascending=False, inplace=True)

df_titanic.head()

#then use reset index to get first 5

df_titanic.reset_index(drop=True, inplace=True)

df_titanic.head()

# compute mean for 1st 5

df_titanic.loc[0:4, "Age"].mean()

67.0